docs/index.org
#+include: use-org-page.org
#+title: J💛J💛

- welcome to jojo's programming adventure

* aim

  - my aim of programming language design
    is to explore the usage of
    'proposition as type' and 'program as proof'
    for algebraic topological purpose

* docs

*** implementations

    - [[./jojo.html][a dynamic threaded code interpreter written in c]]

    - an extendable virtual machine in python

    - an implementation using rust [for fun]

    - [[./core.html][dynamic jojo core]]

    - typed jojo code

*** books

    - [[./EOPL.html][EOPL]]
    - CSP
    - CCP
    - minikanren
    - SICP
    - little schemer
    - HOTT

*** design notes

    - 2017-08-17 [[./inlining-monads.html][inlining moands]]

* license

  - I dedicate all my works here to all human beings
