docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-26 Tue 02:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>J💛J💛</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" type="text/css" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">J💛J💛</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb07421f">aim</a></li>
<li><a href="#org354fa54">docs</a>
<ul>
<li><a href="#org26d5225">implementations</a></li>
<li><a href="#org3316de6">books</a></li>
<li><a href="#orgc7df9cd">design notes</a></li>
</ul>
</li>
<li><a href="#org52d26b1">license</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>welcome to jojo's programming adventure</p></li></ul>

<div id="outline-container-orgb07421f" class="outline-2">
<h2 id="orgb07421f">aim</h2>
<div class="outline-text-2" id="text-orgb07421f">
<ul class="org-ul">
<li><p>my aim of programming language design</p><p>is to explore the usage of</p><p>'proposition as type' and 'program as proof'</p><p>for algebraic topological purpose</p></li></ul>
</div>
</div>

<div id="outline-container-org354fa54" class="outline-2">
<h2 id="org354fa54">docs</h2>
<div class="outline-text-2" id="text-org354fa54">
</div><div id="outline-container-org26d5225" class="outline-3">
<h3 id="org26d5225">implementations</h3>
<div class="outline-text-3" id="text-org26d5225">
<ul class="org-ul">
<li><p><a href="./jojo.html">a dynamic threaded code interpreter written in c</a></p></li>

<li><p>an extendable virtual machine in python</p></li>

<li><p>an implementation using rust [for fun]</p></li>

<li><p><a href="./core.html">dynamic jojo core</a></p></li>

<li><p>typed jojo code</p></li></ul>
</div>
</div>

<div id="outline-container-org3316de6" class="outline-3">
<h3 id="org3316de6">books</h3>
<div class="outline-text-3" id="text-org3316de6">
<ul class="org-ul">
<li><p><a href="./EOPL.html">EOPL</a></p></li>
<li><p>CSP</p></li>
<li><p>CCP</p></li>
<li><p>minikanren</p></li>
<li><p>SICP</p></li>
<li><p>little schemer</p></li>
<li><p>HOTT</p></li></ul>
</div>
</div>

<div id="outline-container-orgc7df9cd" class="outline-3">
<h3 id="orgc7df9cd">design notes</h3>
<div class="outline-text-3" id="text-orgc7df9cd">
<ul class="org-ul">
<li><p>2017-08-17 <a href="./inlining-monads.html">inlining moands</a></p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org52d26b1" class="outline-2">
<h2 id="org52d26b1">license</h2>
<div class="outline-text-2" id="text-org52d26b1">
<ul class="org-ul">
<li><p>I dedicate all my works here to all human beings</p></li></ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xieyuheng</p>
<p class="date">Created: 2017-09-26 Tue 02:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
